// Тип данных String

// Многострочная запись
// let text = `Привет!
// Эти кавычки 
// позволяют писать значение переменной
// в несколько строк
// `;

// Вставка переменной в текст
// let num = 24;
// let text = `Мой любимый номер = ${num}`;
// console.log(text);


// // Способ вывода текста посимвольно
// for (const char of text)
// {
//     console.log(char);
// }

// // Поиск подстроки в строке
// let text = "Привет!";
// console.log(text.indexOf('рив')); // Поиск 'рив' во всем содержимом text
// console.log(text.indexOf('рив', 2)); // Поиск 'рив' в содержимом text, начиная с 2 позиции

// // indexOf - возращает позицию строки, начиная с которой идёт совпадение подстроки с этой строкой
// // вернет -1, если совпадение не найдено
// // Существуют и другие методы работы со строками


// Сравнение строк

// Алфавитный порядок. Ближе к началу алфавита - меньшее
console.log("a" < "b");
// Регистр. Маленькая буква > Большой буквы
console.log("a" > "A");
// Длина. Длинное слово > короткого
console.log("abs" > "abc");

